## section11 필터링

In [1]:
import pandas as pd

df = pd.read_csv('./data/cafe2.csv')
df.head(2)

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN

### 01. 1개 조건 필터링

In [2]:
df['칼로리'] < 50

0     True
1    False
2    False
3    False
4     True
5    False
6     True
7    False
Name: 칼로리, dtype: bool

In [3]:
df[df['칼로리'] < 50]

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
4  에스프레소  4000   20   NaN
6     녹차  5300    0   NaN

In [4]:
cond = df['칼로리'] < 50
df[cond]

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
4  에스프레소  4000   20   NaN
6     녹차  5300    0   NaN

### 02. NOT 연산자

In [6]:
cond = df['칼로리'] < 50
df[~cond]

     메뉴    가격  칼로리   원산지
1  카페라떼  5000  110   NaN
2  카페모카  5500  250  과테말라
3  카푸치노  5000  110  과테말라
5   밀크티  5900  210   NaN
7  딸기라떼  5700  280   NaN

### 03. 복수 조건 필터링

In [9]:
# 가격이 5,000원 이하면서 칼로리가 100보다 큰 데이터
cond1 = df['가격'] <= 5000
cond2 = df['칼로리'] > 100
df[cond1 & cond2]

     메뉴    가격  칼로리   원산지
1  카페라떼  5000  110   NaN
3  카푸치노  5000  110  과테말라

In [10]:
# 가격이 5,000원 이하거나 칼로리가 100보다 큰 데이터
cond1 = df['가격'] <= 5000
cond2 = df['칼로리'] > 100
df[cond1 | cond2]

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN
2   카페모카  5500  250  과테말라
3   카푸치노  5000  110  과테말라
4  에스프레소  4000   20   NaN
5    밀크티  5900  210   NaN
7   딸기라떼  5700  280   NaN

### 04. isin()을 사용한 필터링

In [13]:
df['메뉴'].isin(['녹차'])

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
Name: 메뉴, dtype: bool

In [14]:
# 데이터프레임에 불리언 대입시 조건 만족 데이터(행)만 조회 가능
cond = df['메뉴'].isin(['녹차'])
df[cond]

   메뉴    가격  칼로리  원산지
6  녹차  5300    0  NaN

In [15]:
box = ['녹차', '카푸치노', '카페라떼']
cond = df['메뉴'].isin(box)
df[cond]

     메뉴    가격  칼로리   원산지
1  카페라떼  5000  110   NaN
3  카푸치노  5000  110  과테말라
6    녹차  5300    0   NaN